In [2]:
import numpy as np
import pandas as pd

In [5]:
data = pd.DataFrame(np.random.randn(5,4),index=list('ABCDE'),columns=list('WXYZ'))

In [6]:
data

          W         X         Y         Z
A -0.672956  1.243033 -1.085117  0.936008
B  2.394315  0.049910  1.308092 -0.868541
C -0.950825 -0.203974 -1.235564 -0.540501
D  0.676007 -0.180732  0.228307 -0.198662
E -1.315546  0.056643 -0.435944 -1.043546

In [ ]:
#np.random.randint(1,30,(10,3))

In [9]:
data.reset_index()

  index         W         X         Y         Z
0     A -0.672956  1.243033 -1.085117  0.936008
1     B  2.394315  0.049910  1.308092 -0.868541
2     C -0.950825 -0.203974 -1.235564 -0.540501
3     D  0.676007 -0.180732  0.228307 -0.198662
4     E -1.315546  0.056643 -0.435944 -1.043546

In [10]:
data['State']=['CA','NY','WY','OR','CD']

In [11]:
data

          W         X         Y         Z State
A -0.672956  1.243033 -1.085117  0.936008    CA
B  2.394315  0.049910  1.308092 -0.868541    NY
C -0.950825 -0.203974 -1.235564 -0.540501    WY
D  0.676007 -0.180732  0.228307 -0.198662    OR
E -1.315546  0.056643 -0.435944 -1.043546    CD

In [12]:
data.set_index('State')

              W         X         Y         Z
State
CA    -0.672956  1.243033 -1.085117  0.936008
NY     2.394315  0.049910  1.308092 -0.868541
WY    -0.950825 -0.203974 -1.235564 -0.540501
OR     0.676007 -0.180732  0.228307 -0.198662
CD    -1.315546  0.056643 -0.435944 -1.043546

In [13]:
data

          W         X         Y         Z State
A -0.672956  1.243033 -1.085117  0.936008    CA
B  2.394315  0.049910  1.308092 -0.868541    NY
C -0.950825 -0.203974 -1.235564 -0.540501    WY
D  0.676007 -0.180732  0.228307 -0.198662    OR
E -1.315546  0.056643 -0.435944 -1.043546    CD

In [16]:
data.set_index('State',inplace=True)

In [17]:
data

              W         X         Y         Z
State
CA    -0.672956  1.243033 -1.085117  0.936008
NY     2.394315  0.049910  1.308092 -0.868541
WY    -0.950825 -0.203974 -1.235564 -0.540501
OR     0.676007 -0.180732  0.228307 -0.198662
CD    -1.315546  0.056643 -0.435944 -1.043546

In [18]:
dataframe = pd.DataFrame({'Col1':[1,2,3,4],'Col2':[444,555,666,444],'Col3':['abc','def','ghi','xyz']})

In [19]:
dataframe

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Unique Values.

In [22]:
dataframe['Col2'].nunique()

3

In [25]:
dataframe['Col2'].unique()

array([444, 555, 666], dtype=int64)

#### Values Counts.

In [26]:
dataframe['Col2'].value_counts()

444    2
555    1
666    1
Name: Col2, dtype: int64

In [27]:
type(dataframe['Col2'])

pandas.core.series.Series

In [28]:
a = dataframe['Col2'].values   #to convert the series to arrays.
type(a)

numpy.ndarray

In [51]:
a =([dataframe['Col2']==666]) and ([dataframe['Col3']=='ghi'])
a

[0    False
 1    False
 2     True
 3    False
 Name: Col3, dtype: bool]

In [54]:
dataframe[(dataframe['Col2']==666) & (dataframe['Col3']=='ghi')]

   Col1  Col2 Col3
2     3   666  ghi

In [57]:
dataframe[(dataframe['Col2']==666) & (dataframe['Col3']=='ghi')]['Col1']

2    3
Name: Col1, dtype: int64

In [ ]:
###df[df['salary']==60000 & df['Position']=='DA']]['Name'] To fetch to the accuracy data relavant data.

#### Apply

In [58]:
def function(a):
    c=a*a
    return c
function(5)

25

In [59]:
dataframe['Col1'].apply(function)

0     1
1     4
2     9
3    16
Name: Col1, dtype: int64

In [60]:
dataframe['Col1'].apply(lambda x:x*x)

0     1
1     4
2     9
3    16
Name: Col1, dtype: int64

In [75]:
dataframe= pd.DataFrame({'Number':np.arange(0,50),'Age':np.random.randint(0,50,50),'Weight':np.random.randint(0,50,50),'Salary':np.random.randint(0,50,50)})

In [77]:
dataframe.head()

   Number  Age  Weight  Salary
0       0   45      29      36
1       1   31       8      38
2       2   44      23      48
3       3   32      15      27
4       4   35      17      18

In [78]:
dataframe.tail()

    Number  Age  Weight  Salary
45      45    6      42      43
46      46    0       9      25
47      47   34      16      19
48      48   13      17      32
49      49   38      31      26

In [79]:
dataframe.aggregate(['sum','min','max'])

     Number   Age  Weight  Salary
sum    1225  1161    1212    1270
min       0     0       0       0
max      49    48      48      48

In [80]:
dataframe.aggregate({'Number':['min','max'],'Age':['min','max','mean'],'Weight':['min','mean'],'Salary':['max','mean']})

      Number    Age  Weight  Salary
max     49.0  48.00     NaN    48.0
mean     NaN  23.22   24.24    25.4
min      0.0   0.00    0.00     NaN